{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/Indoor-plants--Taxon.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":15,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"Eid Al Adha","mini_title":"","btn_title":"","bannerfull_url":"shopify:\/\/collections\/eid-al-adha-2022","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"flowers","products_limit":20,"ena_filter":true,"ena_filter2":true}},"1664185408bd5f0d00":{"type":"FAQ-template-v2","blocks":{"15f7309d-46ae-408c-b63a-b19b47ea31bb":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Purchase top-notch indoor plants in Dubai at 800flower.ae","content":"<p>The best way to refresh your interiors and provide a new lease of life is by using indoor plants Dubai. These plants are not only beautiful and elegant but also offer a lot of health benefits. Indoor plants Dubai can purify the indoor air and increase the oxygen supply. This, in turn, reduces stress and anxiety and improves your mood. <\/p>"}},"0e59d8fc-9b03-4a5c-ac6b-c6c5ba51b747":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Things to consider while purchasing indoor plants online","content":"<p>All plants look beautiful indoors. But there are certain things that you should consider while purchasing <strong>indoor plants dubai online.<\/strong><\/p><p><strong>Sunlight in the room:<\/strong> Indoor plants online require different amounts of sunlight. While some <strong>indoor plants UAE online<\/strong> require a few hours of sunlight daily, others can survive in dark areas. Thus, it would be best to consider where you are keeping the plant before doing <strong>indoor plants online shopping.<\/strong><\/p><p><strong>The room's humidity<\/strong>: The humidity requirement varies from plant to plant. Plants like monstera that grow in the tropics can tolerate moisture in the air. Succulents, on the other hand, can survive in dry conditions. Flowering plants like <a href=\"https:\/\/www.800flower.ae\/collections\/orchid\" title=\"https:\/\/www.800flower.ae\/collections\/orchid\"><strong>orchids Dubai <\/strong><\/a>requires medium humidity. The humidity level of your interior should also be considered when you <strong>buy indoor plants online.<\/strong><\/p><p><strong>Pets and kids:<\/strong> Not all plants are safe for kids and pets. It would help if you thoroughly researched the plant's toxicity before purchasing Indoor Plants Online. If you like a particular plant that is toxic for kids and pets, consider placing it high up out of reach of kids and pets. <\/p>"}},"0bf781bd-04cb-4346-ad68-8322473086ef":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Running late? Opt for indoor plants same-day delivery","content":"<p>There are times when you need indoor plants urgently. You either want to surprise someone with indoor plants delivery or beautify your house for some celebrations. Indoor plants same-day delivery ensures that you get the right plant within three hours. <\/p><p>For placing indoor plants same day delivery, first, you should select the plant of your choice. You can choose from various plants like Zanzibar, anthurium, ficus lyrata, or snake plant. If you want larger plants, you can opt for a big areca plant. We also have mini cactus that add a green touch to your interior. Once you have purchased the plant, you can opt for same day delivery at check out. This ensures that the plant is delivered within three hours of placing the order. <\/p><p>In Dubai, same-day delivery facility is available for all orders placed before 7 pm. For Sharjah, you should place the orders before 1 pm to ensure same-day delivery. However, we can deliver the order only the next day to Abu Dhabi. Same-day delivery is offered free of charge provided the minimum order is above AED 300. <\/p>"}},"f45bfc28-46e4-4447-98e4-236b519049ad":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Best indoor plants delivery Dubai","content":"<p>At <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">800flower.ae<\/a>, we stock up on a variety of indoor plants for our customers. You can pick from various indoor plants delivery Dubai based on your preference.<\/p><p><strong>Zanzibar plant<\/strong>: The Zanzibar plant or ZZ plant is a very popular indoor plant. It has waxy leaves and deep green foliage that provides a stunning look. The plant prefers bright, indirect sunlight and very little water for survival. <\/p><p><strong>Fiddle leaf fig:<\/strong> The fiddle leaf fig or ficus lyrata is a plant that belongs to the fig family. The plant has large leaves and is native to Western Africa. It requires indirect natural light and a lot of space for healthy growth. <\/p><p><strong>Areca plant<\/strong>: Areca plants are tall indoor plants that grow in large pots. They have feathery, arching leaves and come in bright green. Water the plant when the top layer of the soil turns dry.<\/p><p><strong>Snake plant:<\/strong> The snake plant is one of the best indoor plants delivery Dubai that can survive for five to ten years. The plant requires very little water as it belongs to the succulent family. <\/p>"}}},"block_order":["15f7309d-46ae-408c-b63a-b19b47ea31bb","0e59d8fc-9b03-4a5c-ac6b-c6c5ba51b747","0bf781bd-04cb-4346-ad68-8322473086ef","f45bfc28-46e4-4447-98e4-236b519049ad"],"settings":{"enable_rich_schema":true,"section_title":"Shop high-quality indoor plants Dubai at 800flower.ae","section_title2":"","title_margin_bottom":1,"max_width":"64rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.4,"q_color":"","a_color":""}}},"order":["collection_template","1664185408bd5f0d00"]}