{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/Birthday-Taxon_1.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":30,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"hku","mini_title":"","btn_title":"","bannerfull_url":"https:\/\/www.shopify.com\/free-trial?ref=shopifycenter","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"birthday","products_limit":10,"ena_filter":true,"ena_filter2":true}},"1656396335c2fde747":{"type":"FAQ-template-v2","blocks":{"bb73119d-40aa-4d82-b212-35e41dacee01":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Send Birthday Flowers Delivery and Gifts Today","content":"<p>Brighten their day with the perfect birthday flowers delivered in Dubai, Abu Dhabi, and across the UAE. We have birthday flowers for her, including the perfect bouquets and arrangements. To make it extra special, you can add birthday balloons, teddy bears, and birthday cakes! What an amazing surprise this flower delivery will be! 800Flower's birthday flower arrangements come in all prices and several flower types, giving you choice.<\/p>"}},"e9ccb30b-c794-4b8a-a47c-973ddec554d4":{"type":"faq","settings":{"checkbox_expanded":true,"title":"What is the best Birthday Gift to send in Dubai?","content":"<p>Sending flowers is always a great way to celebrate a birthday. 800Flower.ae can help deliver a surprise to make the birthday celebration extra special.  But, if you don’t know which flowers to send, here are some of our best sellers: Roses, Lilies, Orchids, Plants, Tulips.<\/p>"}},"3978b2f4-d3f9-4c60-9251-ac1b1941bde6":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Flowers Delivery Today?","content":"<p>If you need same-day flower delivery of birthday flowers, trust 800flower.ae. Most birthday flowers, balloons, cakes, and gifts are available for delivery today in Dubai, Abu Dhabi, and across the UAE.  During checkout, you can see the available delivery times based on the city<\/p>"}},"99763cc6-8eaa-41ce-a49e-0111e42ce804":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Gift Delivery Abu Dhabi","content":"<p>800 Flower is the best online shop to order birthday flowers, gifts, cakes, chocolates and flowers online with same day delivery to Abu Dhabi. If you're looking for quality birthday gifts to a new baby, friends, family or loved ones then look no further, contact 800 Flower for gift delivery in Abu Dhabi, United Arab Emirates (UAE) and give them the happiness they deserve!<\/p>"}},"6995e2a6-e22b-426f-af29-324254092f44":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Happy Birthday Flowers","content":"<p>Birthdays are special for everyone. Whether you are a child, adolescent or adult, birthdays can bring a unique feel you cherish. Gifting happy birthday flowers is a great way to bring that special feeling to a birthday. It can be just a bunch of flowers or an exquisite piece of artistically crafted happy birthday flowers. <\/p>"}},"082899ee-3ace-4397-a40f-381a307dc506":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Surprise Your Dear One With a Birthday Bouquet of Flowers","content":"<p>Your dear ones' birthday is always special for you. Whether it is your spouse, parents or siblings, you want to make their birthday extra special. The birthday bouquet of flowers from 800flower.ae is tastefully crafted to bring a smile to your loved ones' faces.  <\/p><p>At <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">800 Flower<\/a>, we stock up on a wide range of birthday flowers in different colours and styles. We have simple roses in red, pink, orange and white colours. While red roses make great <a href=\"https:\/\/www.800flower.ae\/collections\/love\" title=\"https:\/\/www.800flower.ae\/collections\/love\">love flowers<\/a> for birthdays, pink roses make an excellent option for your female friend. White personifies innocence, and you can gift it to someone pure and sweet from the heart. <\/p><p>Our birthday bouquet of flowers also comes in other varieties like lilies, hydrangeas, and carnation. Beautiful orchids in colourful vases make a perfect choice for that exotic birthday gift. We also have mixed bouquets with an array of birthday wishes flowers like roses, hydrangeas, peonies and carnations. You can also choose birthday month flowers like carnations for January, daisies for April and rosees for June birthdays. <\/p>"}},"cd665f38-6763-46b6-aab0-ac4d8f684af6":{"type":"faq","settings":{"checkbox_expanded":true,"title":"How To Ensure Birthday Flower Same-day Delivery?","content":"<p>Unlike other gifts, happy birthday flowers should be delivered on the same day. This makes the birthday person feel loved and blessed. Your care and consideration can make the birthday even more special. Birthday flower same-day delivery service ensures that the flowers are at the doorstep at the right date and time. <\/p><p>To ensure birthday flower delivery Dubai at the right time, it is very important to book the birthday flower bouquets well ahead of time. This ensures that you get the right flower at a better rate, as our team can procure the flowers per your choice. Moreover, you need not run around at the last moment looking for birthday flowers. <\/p><p>But sometimes you tend to forget the birthday of someone close. At 800flower.ae, we offer birthday flower same-day delivery. Thus, even if you forget to place the order ahead of time, we ensure that the flowers are delivered on the same day anywhere in Dubai. We recommend placing orders one day ahead for places like Abu Dhabi, Sharjah, Fujairah, Umm Al Quwain and Ras-Al-Khaimah. <\/p>"}},"5dd3db50-1305-41c5-b50c-a21e59d94b50":{"type":"faq","settings":{"checkbox_expanded":true,"title":"How To Place An Order For Birthday Flower Delivery Dubai?","content":"<p>Online flower shops ensure you can order birthday flower delivery Dubai at any time. First, you should select the right flower bouquet from our range of flowers. You can select from roses, hydrangeas, lilies, orchids and sunflowers. Once selected, you should specify the size of the bouquet. Most bouquets are available in original, deluxe and grande sizes. <\/p><p>You should now add the flower bouquet to the cart and specify the date and time of delivery. You should clearly mention the address so that birthday flower delivery Dubai happens in the right place. Once done, you can proceed to pay for the order. We accept different modes of payment like credit cards, PayPal, and Apple Pay. We also offer cash on delivery. <\/p><p>To ensure that the order moves smoothly, placing the order a few days before the birthday is always advisable. You can then select flowers of your choice at a reasonable price. However, if you are in a last minute hurry, we even offer same-day delivery. Thus, you will not miss out on gifting that dearest person on their birthday. <\/p>"}}},"block_order":["bb73119d-40aa-4d82-b212-35e41dacee01","e9ccb30b-c794-4b8a-a47c-973ddec554d4","3978b2f4-d3f9-4c60-9251-ac1b1941bde6","99763cc6-8eaa-41ce-a49e-0111e42ce804","6995e2a6-e22b-426f-af29-324254092f44","082899ee-3ace-4397-a40f-381a307dc506","cd665f38-6763-46b6-aab0-ac4d8f684af6","5dd3db50-1305-41c5-b50c-a21e59d94b50"],"settings":{"enable_rich_schema":true,"section_title":"Happy Birthday Flowers, For A Delightful Birthday","section_title2":"Birthday Flowers Dubai","title_margin_bottom":2.7,"max_width":"55rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.1,"q_color":"#7d7b7b","a_color":""}}},"order":["collection_template","1656396335c2fde747"]}