{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/candles-taxon.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":15,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"Eid Al Adha","mini_title":"","btn_title":"","bannerfull_url":"shopify:\/\/collections\/eid-al-adha-2022","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"flowers","products_limit":20,"ena_filter":true,"ena_filter2":true}},"1663073593d3f509be":{"type":"FAQ-template-v2","blocks":{"df51df1b-24cc-4fef-9ed0-27d0b8a07707":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Candles Dubai For That Exotic Touch","content":"<p>Decorations are incomplete without candles Dubai. Whether decorating your home for a party or a hall for an event, candles Dubai provide an exotic touch. It also makes an excellent gift for any occasion. The delightful and heavenly fragrance from candles provides a refreshed and rejuvenated feel to the interiors. It also sets in the right mood and feeling to a room. <\/p>"}},"88fad1a4-2ee4-43d6-85b3-6325096c5e98":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Buy Online Candles Dubai At Affordable Rates","content":"<p>At <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">800 Flower<\/a>, we sell online candles Dubai in different fragrances and styles. We have container candles in various fragrances like lily, Jasmine tuberose, and bloom scents. We have the eternal Oudh candle and the Persian rose candle for that typical Arabic scent. The Elysian Fig candle combines the fragrance of fig, amber and wild moss. <\/p><p>You can also buy tealight scented candles Dubai from our collection. Our tealight Dubai candles are available as a set of five. The bloom set has candles in Persian rose, Sandalwood rose, bloom, lavender and Jasmine tuberose fragrance. We also have Marhaba Dubai candles in Mystic Oudh, Eternal Oudh, Myrrh Frankincense, So Oud and amberwood fragrance. If you are looking for online candles Dubai with a theme, you can go for floral candles or sea-themed candles in a jar. <\/p><p>Candles make an excellent gift for all occasions. Whether it is a birthday, anniversary or simply a visit to your friends, you can gift exotic candles. You can buy candles online Dubai as such or team it up with other accompaniments like <a href=\"https:\/\/www.800flower.ae\/collections\/candles\" title=\"https:\/\/www.800flower.ae\/collections\/candles\">Balloons Duba<\/a>. <\/p>"}},"6db09645-61ce-40fc-942c-8317cb396a41":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Delight Your Loved Ones with Candles Same-Day Delivery","content":"<p>The best way to share your joy with someone is by providing gifts. A gift can bring a smile to your loved one's face and make them feel amazing. One of the best gifts you can give your loved one is candles. By gifting candles, you share your life's brightness with someone. The sweet aroma and flickering light of the candle will surely bring a smile to your loved one's face. <\/p><p>Quickly sending a gift is the norm these days. This is made possible through candles same-day delivery. You can place the order any time of the day, and we will deliver the candles to the recipient within three hours. Thus, even if you forget your loved one's birthday or anniversary, you can send a last-minute gift to them.   <\/p>"}}},"block_order":["df51df1b-24cc-4fef-9ed0-27d0b8a07707","88fad1a4-2ee4-43d6-85b3-6325096c5e98","6db09645-61ce-40fc-942c-8317cb396a41"],"settings":{"enable_rich_schema":true,"section_title":"Dubai Candles","section_title2":"","title_margin_bottom":1,"max_width":"64rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.4,"q_color":"","a_color":""}}},"order":["collection_template","1663073593d3f509be"]}