{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/Orchids-2-Taxon.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":15,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"Eid Al Adha","mini_title":"","btn_title":"","bannerfull_url":"shopify:\/\/collections\/eid-al-adha-2022","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"flowers","products_limit":20,"ena_filter":true,"ena_filter2":true}},"9b8bd75e-5a30-4607-a445-bef33e6dc9c5":{"type":"FAQ-template-v2","blocks":{"c6f797bb-ad8d-4dd6-a8be-d84358a43c8f":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Get premier orchid plants Dubai","content":"<p>Orchids are an exotic variety of <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">flowers<\/a> that can provide a new dimension to your interiors. Orchid Plants Dubai is striking and beautiful and is guaranteed to impress anyone who sets their eyes on it. Orchids symbolise class and style and provide a soft and elegant touch to any floral arrangement or decor blend.<\/p>"}},"30880a71-6e76-4138-900e-7df387f72b88":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Buy orchid plants online","content":"<p>There are around 28000 species of orchids identified around the world. These are subdivided into 850 subgroups based on their features. Of the different species of orchids, vanda, phalaenopsis, dendrobium and moth orchids are popularly found. <\/p><p>The peculiarity of orchid plants is that they are perennial. In the wild, orchids can survive for close to 20 years. But as potted plants, the lifespan is less. With proper care and maintenance, orchids can live for 10-15 years. Orchid plants online are available in various colours like white, pink, yellow, orange, red and purple. With their soothing aroma and striking look, orchid plants for sale can captivate the attention of all. <\/p><p>If you want to buy orchid plants online, several shops offer high-quality plants. You can buy the plant as such or in combination with <a href=\"https:\/\/www.800flower.ae\/collections\/bonsai\" title=\"https:\/\/www.800flower.ae\/collections\/bonsai\">bonsai tree Dubai<\/a>. Orchid plants online make an excellent gift for any occasion. You can also purchase it to beautify your interior. Its visual appeal is enhanced by the unique pattern in which it is available. You can purchase high-quality orchids from online shops in Dubai.  <\/p>"}},"28f38a9f-7539-4bf8-948a-88567e638823":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Get orchid plants same-day delivery in Dubai","content":"<p>If you think about where to get orchid plants same-day delivery in Dubai, we are here to help you. We stock up on a wide range of orchids in different colours and shades. You can purchase orchid plants delivery in white boxes, glass containers, colourful pots and metal and ceramic vases. Each container is carefully picked to blend with the overall colour and pattern of the orchid. <\/p><p>We offer orchid plants same day delivery across Dubai and Sharjah. In Dubai, all orders placed before 7 pm will be delivered the same day. As for Sharjah, you should place the orders before 1p.m for same-day delivery. We will hand over all same-day delivery to the recipient within 3 hours of placing the order. <\/p><p>You can purchase several complimentary gifts along with orchids. We have special birthday cakes and cookies for birthdays, which you can gift. We also provide balloons, chocolates and candles to make your birthday extra special. You can also write a personal message on the greeting card that goes along with the orchid plant. <\/p>"}},"a60a058f-adb1-4d06-b5ce-9651e261d8e8":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Packing orchid plants delivery Dubai","content":"<p>If you are gifting orchids to someone, packing the same for safe delivery is very important. The flowers and plants should remain intact and fresh until they reach their destination. <\/p><p>To pack orchid plants delivery Dubai, you should first place them in a clay pot. Provide support to the plant, so it does not move and get damaged. You can now gently wrap the plant and the pot with wrapping paper or tissue paper and secure them with tape. Place the plant, along with the wrapper, inside a cardboard box. <\/p><p>Securing the pot well inside the box is very important. You can use wedges or foam and pack the plant tightly. Now you can tape the box and seal it. You can also stick a label to keep the plant upright while transporting. <\/p><p>Packing the plant well for orchid plants delivery Dubai is very important. This ensures that the plant and the soil remain intact and do not come off while transporting. <\/p>"}}},"block_order":["c6f797bb-ad8d-4dd6-a8be-d84358a43c8f","30880a71-6e76-4138-900e-7df387f72b88","28f38a9f-7539-4bf8-948a-88567e638823","a60a058f-adb1-4d06-b5ce-9651e261d8e8"],"settings":{"enable_rich_schema":true,"section_title":"","section_title2":"FAQs","title_margin_bottom":1,"max_width":"64rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.4,"q_color":"","a_color":""}}},"order":["collection_template","9b8bd75e-5a30-4607-a445-bef33e6dc9c5"]}