{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/Luxury-Taxon_99268328-741d-43cc-bff6-847e9763de29.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":20,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"hku","mini_title":"","btn_title":"","bannerfull_url":"https:\/\/www.shopify.com\/free-trial?ref=shopifycenter","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"birthday","products_limit":10,"ena_filter":true,"ena_filter2":true}},"1664183606b836842c":{"type":"FAQ-template-v2","blocks":{"3d318134-32ef-4962-b816-bb90b730f93b":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Dubai's luxury flowers for a unique atmosphere","content":"<p>FAQ Luxury flowers Dubai are a sign of extravagance. It provides a sophisticated look and feel and makes an excellent gift for that special person. Besides, it also forms a glamorous and elegant addition to your interiors. At <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">800flower.ae<\/a>, we stock up on a range of luxury flowers Dubai. From beautiful roses to the elegant hydrangeas and exotic orchids, we have a wide range of luxury flowers. content<\/p>"}},"f3300325-abc4-4050-afe3-5f751f3efc54":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Order luxury flowers online of the right colour","content":"<p>Colour plays a very important role while selecting flowers as it can convey the right emotion. Whether it is roses, orchids or hydrangeas you should pay special attention to the colour when you  buy luxury flowers online. <\/p><p><strong>Red:<\/strong> Red is the colour of love. If you want to gift your loved on Valentine’s day or any other special day you can order luxury flowers online in red colour. <\/p><p><strong>Yellow:<\/strong> Yellow is the colour of happiness and joy. It also denotes friendship. Thus, if you want to order luxury flowers online for a friend, a bunch of yellow roses or sunflower bouquet would be a great option. <\/p><p><strong>Pink:<\/strong> Pink is the colour of femininity. Thus, a bouquet of pink flowers would be a great choice for your female friend or colleague. <\/p><p><strong>White:<\/strong> White is the colour of purity and innocence. This is the main reason white flowers are used in bridal bouquets and also as a gift for new parents.  <\/p><p>Thus while selecting a gift, you should select the right colour that conveys your emotion. It would be a good idea to purchase <a href=\"https:\/\/www.800flower.ae\/collections\/indoor-plants\" title=\"https:\/\/www.800flower.ae\/collections\/indoor-plants\">indoor plants Dubai<\/a> to accompany the flowers. <\/p>"}},"e47fa8d7-18fc-4e57-acad-326cea4f6a22":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Take advantage of luxury flower same day delivery","content":"<p>FAQ content sometimes you tend to forget the birthday of your dear one. Or you decided to provide a last-minute surprise to your friend on their birthday. Luxury flower same day delivery offered by 800flower.ae comes as a boon in such situations. <\/p><p>You can place an online order for flower same day delivery, and it will be delivered to the recipient within three hours. You can even order midnight delivery if you want to surprise your loved one. All our flowers are delivered fresh. Thus, you need not worry about the quality of the bouquet. <\/p><p>Our flower arrangements are available in different styles. You can order a luxury flower bouquet box or simple flower bouquets as per your choice. We even offer dry flower arrangements and indoor plants for same day delivery. We offer luxury flower delivery all over Dubai, Abu Dhabi and Sharjah. Same-day delivery option is available for all orders received in Dubai before 7 pm. For Sharjah orders, the order should be placed before 1 pm for same-day delivery. However, for Abu Dhabi we can deliver the order only on the next day. <\/p>"}},"9a5b02ba-e269-45d0-90a3-cc5450cb677c":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Celebrate special moments with luxury flower delivery Dubai","content":"<p>Make your special days extra special with luxury flower delivery Dubai. Whether it is your birthday, anniversary, or any important festival, our luxury flowers make a great choice. Do you want to congratulate the new parents on the birth of their baby? Our new baby flower bouquets make a perfect gift. Or do you want to send “get well soon” wishes to your dear friend? We have a separate collection for that. <\/p><p>All our flowers are sourced from farms around the world and are available fresh. We have beautiful roses in red, pink, orange and white colours that make a great option for birthdays and weddings. Our sunflower bouquet is bright and cheery and sets the right mood for any occasion. We have exotic <a href=\"https:\/\/www.800flower.ae\/collections\/orchid\" title=\"https:\/\/www.800flower.ae\/collections\/orchid\">orchids <\/a>that make an ideal gift and home decor product. <\/p><p>The main advantage of shopping from our website is that you get luxury flower delivery Dubai on the same day. We even offer midnight delivery of flowers to surprise that special person. Add a touch of richness and class to your celebrations with our luxury collection. <\/p>"}}},"block_order":["3d318134-32ef-4962-b816-bb90b730f93b","f3300325-abc4-4050-afe3-5f751f3efc54","e47fa8d7-18fc-4e57-acad-326cea4f6a22","9a5b02ba-e269-45d0-90a3-cc5450cb677c"],"settings":{"enable_rich_schema":true,"section_title":"Luxury flowers Dubai for that exotic feel","section_title2":"","title_margin_bottom":1,"max_width":"64rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.4,"q_color":"","a_color":""}}},"order":["collection_template","1664183606b836842c"]}