{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/Flowerboxes--Taxon_1.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":15,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"Eid Al Adha","mini_title":"","btn_title":"","bannerfull_url":"shopify:\/\/collections\/eid-al-adha-2022","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"flowers","products_limit":20,"ena_filter":true,"ena_filter2":true}},"1663072360fd542ed1":{"type":"FAQ-template-v2","blocks":{"99ec42b1-1aae-4dcb-b510-3f584a0927eb":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Beautify The Interiors with Flower Boxes Dubai","content":"<p>Fresh flowers can add a special charm to the interiors. It provides a refreshed and renewed look and brightens up the interior. One way to add fresh flowers to your decor is by going for flower boxes Dubai. These flower boxes Dubai have beautiful floral arrangements with different varieties and colours of flowers to beautify your interior.  <\/p>"}},"48a94212-555a-45c5-9126-a1cb971f5ad2":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Flower Boxes Online For A New Look","content":"<p>Flower bouquets and floral arrangements are pretty common. Special flower boxes make a perfect choice if you want to provide a unique gift to someone. These are rectangular boxes with beautiful flowers of different colours and varieties arranged for that ultimate look. You can purchase flower boxes online for gifting and decor purpose. <\/p><p>There are different varieties of flower boxes online for you to choose from. Window flower boxes are specially designed to be placed on the windowsill. But you should ensure that the flowers do not get direct sunlight as they can wither off fast. A box of roses is ideal for gifting, especially a box of red roses for your dear one. <\/p><p>Another exotic variety of flower box gift from our collection is the <a href=\"https:\/\/www.800flower.ae\/collections\/new-baby\" title=\"https:\/\/www.800flower.ae\/collections\/new-baby\">New born baby flowers Dubai<\/a>. These are specially designed boxes with a newborn baby topper, a teddy bear and balloons. These are available in both pink and blue shades to gift a baby girl or boy. <\/p><p>The peculiarity of our flower box is that it comes well arranged with flower food. You only have to place them in the right location for that elegant look. <\/p>"}},"9b0c9c48-d9f6-4894-be25-d2688208265c":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Flower Boxes Same Day Delivery From 800 Flower","content":"<p>At 800 Flower, we ensure flower boxes same-day delivery. We have the right product for you if you want to order flower boxes delivery as a gift or for decoration. You can pick from a variety of flower boxes for same-day delivery. To gift your lover, we have red roses flower boxes in different sizes and styles. Our pink rose flower box would be apt for a female friend. You can also use it to decorate your baby girl’s room. <\/p><p>Our speciality is the orchid bouquet that makes an exotic flower arrangement. An orchid bouquet makes a perfect decor piece for the reception area of your office. For gifting new parents on the arrival of a baby, we even have baby flower boxes for both boys and girls. <\/p><p>We offer <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">flower delivery all over Dubai<\/a>. All you have to do is to place your order on our website, and we will deliver the product at the right place and time. For orders above AED 300, we offer free same-day delivery. Thus, you need not pay extra for express delivery. <\/p>"}},"636ff007-033c-4071-81c5-ca73e751bdc8":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Flower Boxes Delivery Dubai From The Best Online Store","content":"<p>800flower.ae offers flower boxes delivery Dubai all over the Emirates. You can select the available delivery date from the calendar and specify the delivery time and place. We also specify a minimum order of AED 100 for delivery. <\/p><p>We have a midnight delivery option by which your order will be delivered 20 minutes before midnight. To avail of the midnight delivery option, all you have to do is to select the same at the time of checkout. <\/p><p>Another option we provide for flower boxes delivery Dubai is express delivery. Through express delivery, your order will be sent to the recipient within three hours of placing the order. Like all types of delivery, you should specify an express delivery option at the time of checkout. All orders above AED 300 will be delivered free of cost across Dubai and Sharjah. You can also avail free delivery of non-flower orders like plants or cakes, provided you have added at least one flower arrangement to the cart. If you place non-flower orders, we will charge a nominal delivery charge of AED 35. <\/p>"}}},"block_order":["99ec42b1-1aae-4dcb-b510-3f584a0927eb","48a94212-555a-45c5-9126-a1cb971f5ad2","9b0c9c48-d9f6-4894-be25-d2688208265c","636ff007-033c-4071-81c5-ca73e751bdc8"],"settings":{"enable_rich_schema":true,"section_title":"Dubai Flower Boxes","section_title2":"","title_margin_bottom":1,"max_width":"64rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.4,"q_color":"","a_color":""}}},"order":["collection_template","1663072360fd542ed1"]}