{"sections":{"collection_template":{"type":"collection-template","settings":{"select_style_bread":"style_2","ena_bg_img":true,"bg_breadcrumb":"shopify:\/\/shop_images\/Love-Taxon-3.jpg","bg_color_breadcrumb":"#ffffff","color_breadcrumb":"#ffffff","collection_layout":"full_width","prod_per_page":21,"prod_layout":"prod_grid","prod_per_row":"prod_col_4","filter_layout":"filter_push_left","sidebar_layout":"sidebar_left","ena_sticky_sidebar":true,"ena_banner_mordern":false,"big_title":"hku","mini_title":"","btn_title":"","bannerfull_url":"https:\/\/www.shopify.com\/free-trial?ref=shopifycenter","color_title":"#ffffff","ena_best_seller":false,"title_heading":"BEST SELLERS","select_collection":"birthday","products_limit":10,"ena_filter":true,"ena_filter2":true}},"16630697983253cc00":{"type":"FAQ-template-v2","blocks":{"129747bf-6dc9-4c7b-8b84-1b88140b9cf3":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Love Flowers For Your Dear One From 800 Flower","content":"<p>One of the ways to express your love to your dear ones is by gifting a bouquet of love flowers. These are artistically designed bouquet of flowers that can convey your emotions and feelings in the true sense. The love flowers come in different sizes, colours and patterns that you can select one based on your budget and preference. <\/p>"}},"112c6e13-9792-4eeb-9fc0-743f49516081":{"type":"faq","settings":{"checkbox_expanded":true,"title":"How To Place Order For Love Flowers Delivery in Dubai?","content":"<p>As mentioned earlier, gifting love flowers are one of the best ways to convey your love to your dear one. Here are some simple steps to follow to place order for love flowers delivery in Dubai.  <\/p><p>Search the variety of love flowers on our website. A Few of the flowers that you can choose are love rose flower and sentimental love heart box flower. If you want to purchase <a href=\"https:\/\/www.800flower.ae\/collections\/luxury\" title=\"https:\/\/www.800flower.ae\/collections\/luxury\">luxury flowers<\/a> for your dear one, we have a separate section for that. <\/p><p>Once you have selected the flower, you should add it to the cart. This makes it easy to pay and check out. If you want to add other accompaniments like cakes and cookies, you can do so at this stage. <\/p><p>Next, the name and address of the recipient should be entered so that we can offer love flowers delivery to the correct location. <\/p><p>Finally, you need to make the payment. We offer different payment options like credit card, Paypal payment, cash on delivery and Apple Pay. <\/p><p>Once all the above steps are correctly followed, the order will be delivered to the right address on the right date. <\/p>"}},"47563a3e-e97a-4c82-93e9-5d5b76dc098f":{"type":"faq","settings":{"checkbox_expanded":true,"title":"Which Is The Best Romantic Flower Dubai, UAE For Gifting?","content":"<p>There are a variety of romantic flower Dubai, UAE that you can gift your dear one. <\/p><p><strong>Roses: <\/strong>Roses, especially red coloured roses, are considered a symbol of love. In Greek and Roman mythology red roses had a prominent place as a symbol of love. Even during Victorian times, rose were considered a flower of romance, passion and devotion. Thus, red roses are considered the most romantic flower Dubai, UAE. <\/p><p><strong>Orchids: <\/strong>Orchids are considered a symbol of luxury. However, they are also considered a flower of love, charm and beauty. Orchids are rarely used in bouquets. They are mostly gifted as a bunch of flowers as orchids have a charm of their own. <\/p><p><strong>Lilies: <\/strong>Lilies, with their gorgeous colours and patterns, make another great romantic flower bouquet. While pink coloured lilies would make a great choice for a vibrant personality, you can gift white lilies to a person who personifies innocence. <\/p><p><strong>Lisianthus<\/strong>: A close resemblance to roses, make lisianthus a favourite <a href=\"https:\/\/www.800flower.ae\/\" title=\"https:\/\/www.800flower.ae\/\">flower <\/a>for romantic gifting. This flower is available in a variety of shades like pink, white and purple and you can select one depending on your personal choice. <\/p>"}},"2a857927-ba99-47c1-8df1-8aeda2f3d2b7":{"type":"faq","settings":{"checkbox_expanded":true,"title":"How To Ensure Same Day Romantic Flower Delivery Dubai?","content":"<p>Normally, you will place online order for flowers a few days ahead of the delivery date. But there are times when you forget to order flowers ahead of time. Sometimes, you decide to gift a bunch of romantic flowers as a surprise. Same day romantic flower delivery Dubai come as a boon in such situations. <\/p><p>Most online flower delivery shops offer the same day romantic flower delivery Dubai service. In most cases, the flowers will be delivered within 2-3 hours of placing the order. But you need to pay extra for such express delivery. <\/p><p>Sometimes it can happen that the recipient is not at home while delivering the flowers. In such cases, the delivery person will call the recipient to inform about the delivery. The flowers will then be delivered safely as per the instruction of the recipient. In case the recipient is not available over the phone, the flowers will be placed at a safe place near the doorstep or will be handed over to the neighbour. In either case, the recipient is assured of fresh romantic flowers delivered at their doorstep. <\/p>"}}},"block_order":["129747bf-6dc9-4c7b-8b84-1b88140b9cf3","112c6e13-9792-4eeb-9fc0-743f49516081","47563a3e-e97a-4c82-93e9-5d5b76dc098f","2a857927-ba99-47c1-8df1-8aeda2f3d2b7"],"settings":{"enable_rich_schema":true,"section_title":"Dubai Love Flowers","section_title2":"","title_margin_bottom":2.1,"max_width":"64rem","margin_top":1,"margin_bottom":1,"background_color":"#ffffff","border_color":"#eeeeee","panel_color":"#fdfdfd","q_size_small":1,"q_size_large":1.4,"q_color":"","a_color":""}}},"order":["collection_template","16630697983253cc00"]}